Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: དེ་ནས་དགེ་སློང་རྣམས་ཀྱིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་གསོལ་པ། བཙུན་པ་ནག་པ་གླང་ཆེན་གནས་མཆིས་བྲང་གིས་ཐབས་བགྱིས་ཏེ། འདོད་པ་སྤྱད་དུ་སྩལ་བ་ལ་གཟིགས།
en: “Lord,” the monks inquired of the Blessed Buddha, “tell us why Citra Mounted on an Elephant’s wife found a means by which to indulge her desires with him.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ད་ལྟར་འབའ་ཞིག་མ་ཡིན་ཏེ། འདས་པའི་དུས་ན་ཡང་འདི་ཆུང་མ་དེས་ཐབས་བྱས་ནས། ཇི་ལྟར་འདོད་པ་སྤྱོད་དུ་བཅུག་པ་དེ་ཉོན་ཅིག །
en: “Not only now,” the Blessed One explained, “but in times past as well, and in the same way, his wife found a means by which to indulge her desires with him. Listen well!

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། གྲོང་ཁྱེར་བཱ་རཱ་ཎ་སཱི་ན། རྒྱལ་པོ་ཚངས་པས་བྱིན་ཞེས་བྱ་བ་རྒྱལ་པོ་བྱེད་དེ། དེའི་ཚེ་རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱི་མདུན་ན་འདོན། བྲམ་ཟེ་མེས་སྦྱིན་ཞེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: “Monks, in times gone by, during King Brahmadatta’s reign in the city of Vārāṇasī, one of King Brahmadatta’s magistrates was a certain brahmin named Agnidatta .

source: ཕྱི་ཞིག་ན་དེའི་ཆུང་མ་ལ་བུ་ཆགས་ནས། བུ་མཚེ་མ་གཉིས་བྱུང་སྟེ།
en: One day his wife conceived, and later she gave birth to twins.

source: དེ་གཉིས་ཀྱི་བཙས་སྟོན་རྒྱས་པར་བྱས་ནས། ཁྱེའུ་འདི་གཉིས་ཀྱི་མིང་ཅི་སྐད་གདགས་ཞེས་མིང་འདོགས་པར་བྱེད་དེ།
en: At the elaborate feast celebrating their birth they asked, ‘What names should we give these children?’ and they named them, saying,

source: ཁྱེའུ་འདི་གཉིས་མེས་སྦྱིན་གྱི་བུ་ཡིན་པས་ན། ཁྱེའུ་གཅིག་གི་མིང་ནི་མེའི་བུ་ཞེས་གདགས་སོ། །
en: ‘Since these are Agnidatta ’s children, one’s name will be Son of Fire,

source: གཅིག་གི་མིང་ནི་མེ་ལྕེ་ཞེས་གདགས་སོ་ཞེས་ཟེར་རོ། །
en: and the other’s will be Tongue of Fire.’

source: དེ་ནས་ཁྱེའུ་མེའི་བུ་དང་། མེ་ལྕེ་གཉིས་འོ་མ་དང་། ཞོ་དང་། མར་དང་། ཞུན་མར་དང་། མར་གྱི་སྙིང་གུས་བསྐྱེད་བསྲིངས་ནས།
en: “They reared young Son of Fire and Tongue of Fire on milk, yogurt, butter, ghee, and milk solids,

source: གང་གི་ཚེ་དེ་གཉིས་ཆེར་སྐྱེས་པ་དེའི་ཚེ། ཡི་གེ་དང་། བྲམ་ཟེའི་སྤྱོད་ལམ་དང་། སྤྱོད་པ་དང་། ཨོཾ་ཞེས་བྱ་བ་དང་། བྷོ་ཞེས་བྱ་བ་དང་། གཙང་སྦྲ་དང་། ཆོ་ག་དང་། ཐལ་བ་བླང་བ་དང་། རིལ་བ་ཐོགས་པ་དང་། ངེས་བརྗོད་ཀྱི་རིག་བྱེད་དང་། མཆོད་སྦྱིན་གྱི་རིག་བྱེད་དང་། སྙན་ཚིག་གི་རིག་བྱེད་དང་། སྲིད་འགལ་བ་ཡོད་ནི་མ་རེད། སྲུང་གི་རིག་བྱེད་དང་། མཆོད་སྦྱིན་བྱ་བ་དང་། མཆོད་སྦྱིན་བྱེད་དུ་གཞུག་པ་དང་། སྦྱིན་པ་དང་། བླང་བ་དང་། ཁ་ཏོན་བྱ་བ་དང་། ཁ་ཏོན་སློབ་ཏུ་གཞུག་པའི་ཐབས་བསླབས་ནས། ལས་རྣམ་པ་དྲུག་ལ་མཁས་པའི་བྲམ་ཟེར་གྱུར་ཏོ། །
en: and as they grew up they studied letters, brahminical customs and conduct, the syllables oṃ and bho , ritual purity, ritual actions , the collection of ashes, holding the ritual vase, the Ṛg Veda , the Yajur Veda , the Sāma Veda , the Atharva Veda , how to perform sacrificial rites, how to lead others in performing sacrificial rites, how to give and receive offerings, recitation, and recitation instruction. Trained in these procedures, they became masters of the six types of brahminical activities,

source: དེ་གཉིས་མཐར་གྱིས་རིག་པའི་གནས་བཅྭ་བརྒྱད་ལ་བྱང་བར་གྱུར་ཏོ། །
en: and in time they mastered the eighteen sciences.

source: ཕྱི་ཞིག་ན་དེ་གཉིས་ཀྱིས་ཕས་ཆོས་དང་ཆོས་མ་ཡིན་པས་རྒྱལ་སྲིད་འཛིན་པ་མཐོང་ངོ་། །
en: “At a certain point the two came to see that their father administrated the affairs of the kingdom both righteously and unrighteously, and an idea came to them.

source: དེ་ཕྱི་ཞིག་ན་དེ་གཉིས་ཀྱིས་བློ་སྐྱེས་པ།
en: They thought,

source: ཕ་མེད་པའི་འོག་ཏུ་ནི་བདག་ཅག་གཉིས་ཕའི་ལས་ཐབས་སུ་བསྐོ་བར་འགྱུར་གྱི།
en: ‘When our father is no longer with us, we will be appointed to take over the work of our father.

source: བདག་ཅག་གཉིས་ཁྱིམ་ན་གནས་པ་བཏང་ངོ་ཞེས་ཟེར་རོ། །
en: Therefore, we should give up living at home.’

source: འཇིག་རྟེན་ཕ་རོལ་གྱིས་འཇིགས་པའི་མིས་ནི་རྒྱལ་སྲིད་ཀྱི་ཕྱིར་བསད་པ་དང་། བཅིང་བ་དང་། བརྡེག་པའི་ལས་བྱེད་པ་བས། ནགས་ཁུང་དུ་ཤིང་ཤུན་གྱི་གོས་གྱོན་ཞིང་ཤིང་ཏོག་ཟ་ལ། གཅན་གཟན་དག་དང་ལྷན་ཅིག་གནས་ཀྱང་བླའི་ཞེས་ཟེར་ནས
en: ‘For those who fear for their next life, it is better to live deep in the forest among the wild animals, wearing tree bark for clothing and eating fruit, than to kill, bind, and torture for the sake of a kingdom.’

source: ཕ་མ་ལ་གསོལ་ཏེ། ཡབ་ཡུམ་བདག་ཅག་གཉིས་དཀའ་ཐུབ་ཀྱི་ནགས་ཚལ་དུ་མཆིའོ་ཞེས་བྱས་སོ། །
en: “ ‘Mother, Father,’ they continued, ‘we are going to live in a forest devoted to austerities.’

source: བུ་གཉིས་གང་གི་ཕྱིར། དྲང་སྲོང་རྣམས་དཀའ་ཐུབ་སྤྱོད་པ་དེ་ནི་ཁྱོད་གཉིས་ཀྱི་ལག་ན་འདུག་སྟེ། ངེད་ཤི་བའི་འོག་ཏུ་ཁྱེད་གཉིས་ཅོད་པན་མེད་པའི་རྒྱལ་སྲིད་འཛིན་པར་འོང་ངོ་། །
en: ‘Children, why are you going to take up the austere practices of the sages, when after our deaths you could come and share the crown?’

source: ཁྱེའུ་དེ་གཉིས་ཀྱིས་སྨྲས་པ། བདག་ཅག་གཉིས་འཇིགས་པ་ཡང་འདི་ཁོ་ན་ཡིན་ཏེ།
en: “ ‘This is exactly what we are afraid of!’ the two children replied.

source: དེའི་ཕྱིར་ན་ནགས་ཁུང་དུ་གནས་བཅའ་བར་འདོད་པས་ན།
en: ‘That’s why we want to go live deep in the forest.

source: བདག་ཅག་གཉིས་ནི་འདོད་པ་ལ་ལོངས་སྤྱོད་པའི་རྔོ་མི་ཐོགས་སོ། །
en: We are not capable of indulging in desire.’

source: དེ་ལྟར་ཕ་མ་གཉིས་ཀྱིས་དེ་གཉིས་ལ་ལན་མང་དུ་བཀག་ཀྱང་དགག་མ་ནུས་ནས། དེ་གཉིས་ལ་ཕ་མས་སྨྲས་པ། རབ་ཏུ་བྱུང་བར་གྱིས་ལ།
en: “Their parents tried many times, but they were not able to stop them, so they said, ‘Go forth, then.

source: གལ་ཏེ་ཁྱད་པར་ཅུང་ཟད་ཐོབ་པར་གྱུར་ན། ངེད་གཉིས་ལ་བལྟར་ཤོག་ཤིག་ཅེས་བྱས་སོ། །
en: And should you achieve any special attainments, please come see us.’

source: དེ་ནས་དེ་གཉིས་ཀྱིས་སྨྲས་པ། ཁྱེད་གཉིས་ཅི་ལྟར་དགྱེས་པ་བཞིན་དུ་འཚལ་ལོ་ཞེས་བྱས་ནས།
en: “ ‘As you wish,’ the two children replied.

source: ཁྱེའུ་དེ་གཉིས་ཀྱིས་ཕ་མ་ལ་འཕྱི་ཕྱག་འཚལ་ཏེ། ནགས་ཁུང་དུ་གནས་བཅས་སོ། །
en: “The children bid a final farewell to their parents and traveled deep into the forest.

source: དེ་གཉིས་དེར་རབ་ཏུ་བྱུང་ནས། བསམ་གཏན་བཞི་དང་། མངོན་པར་ཤེས་པ་ལྔ་བསྐྱེད་དོ། །
en: After they had gone forth, they generated the four meditative states and five superknowledges.

source: དེ་ནས་ཕྱི་ཞིག་ན་དེ་གཉིས་ཀྱི་བློ་སྐྱེས་པ། བདག་ཅག་གཉིས་ཀྱིས་ཕ་མ་ལ་དམ་བཅས་པ། གལ་ཏེ་ཁྱད་པར་ཅུང་ཟད་ཐོབ་པར་གྱུར་ན།
en: One day they remembered their promise to their parents that they would return to them if they achieved any special attainments.

source: ཁྱེད་གཉིས་ལ་བལྟར་འོང་ངོ་ཞེས་བྱས་སོ། །
en: ‘Let us go, then,’ they said.

source: འདོང་ངོ་ཞེས་ཟེར་ནས་སྟེང་གི་ནམ་མཁའ་ལ་དོང་སྟེ། ཕ་མ་གཉིས་ཀྱི་ཐད་དུ་ཕྱིན་ཏོ། །
en: They traveled through the sky and arrived before their parents.

source: དེ་ནས་དེ་མཐོང་མ་ཐག་ཏུ་ཕ་མ་གཉིས་དེ་གཉིས་ལ་ཤིན་ཏུ་དགའ་བར་གྱུར་ཏོ། །
en: Seeing this, their parents felt a surge of joy toward them.

source: དེ་དགའ་བར་གྱུར་ནས་སྨྲས་པ།
en: In their joy they said,

source: ཁྱེད་གཉིས་ཀྱང་བསོད་སྙོམས་འདོད་ལ།
en: ‘The two of you desire alms.

source: ངེད་གཉིས་ཀྱང་བསོད་ནམས་འདོད་ཀྱིས།
en: The two of us desire merit.

source: འདིར་བདག་ཅག་གི་སྐྱེད་མོས་ཚལ་དུ་གནས་པར་གྱིས་ཤིག་དང་། བདག་ཅག་གཉིས་ཀྱིས་ཁྱེད་གཉིས་ཀྱི་ཟན་སྦྱར་རོ་ཞེས་བྱས་སོ། །
en: Stay here in our garden, then, and we will offer you food.’

source: དེ་གཉིས་ཀྱིས་སྨྲས་པ། ཁྱེད་གཉིས་ཇི་ལྟར་དགྱེས་པ་བཞིན་དུ་བགྱིའོ་ཞེས་བྱས་ནས།
en: “ ‘As you wish,’ the two replied.

source: སྐྱེད་མོས་ཚལ་དེ་ཉིད་དུ་ཡལ་ག་དང་། ལོ་མའི་སྤྱིལ་པོ་བཅས་ནས་འཁོད་དོ། །
en: “They fashioned a hut of branches and leaves and stayed there in the garden.

source: དེ་ནས་དེ་གཉིས་བཱ་རཱ་ཎ་སཱིའི་ཕྱོགས་ཀུན་ཏུ་བཀུར་སྟི་བྱ་བ་དང་། བླ་མར་བྱ་བ་དང་། རི་མོར་བྱ་བ་དང་། མཆོད་པ་བྱ་བའི་གནས་སུ་གྱུར་ཏོ། །
en: They came to be held in high esteem and were revered, honored, and venerated.

source: དེ་ནས་རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱིས་མདུན་ན་འདོན་མེས་སྦྱིན་གྱི་བུ་གཉིས་དེ་ལྟར་རྫུ་འཕྲུལ་ཆེ་ཞིང་མཐུ་ཆེ་བར་གྱུར་ཏོ་ཞེས་ཐོས་ནས་ཐོས་མ་ཐག་ཏུ་ངོ་མཚར་དུ་གྱུར་ཏོ། །
en: King Brahmadatta’s magistrate heard that the two children had become persons of great miracles and great power, and this immediately filled him with awe.

source: གཡར་དྲངས་ནས་ཟན་བྱིན་ནོ། །
en: He extended them an invitation and offered them food.

source: ཟན་བྱིན་ནས་རྐང་པ་ལ་ཕྱག་འཚལ་ཏེ། སྨྲས་པ།
en: After offering them food he bowed down at their feet and said,

source: དུས་དུས་སུ་ཁྱེད་གཉིས་ང་ལ་བལྟར་ཤོག་ཤིག་ཅེས་བྱས་སོ། །
en: ‘Please come and see me from time to time.’

source: དེ་ནས་དེ་གཉིས་ཀྱིས་སྨྲས་པ། ལྷ་ཇི་ལྟར་དགྱེས་པ་བཞིན་དུ་བགྱིའོ་ཞེས་བྱས་ནས་
en: “ ‘As you wish, Deva,’ they replied.

source: དེ་གཉིས་སོང་ངོ་། །དེ་ནས་དུས་དུས་སུ་དེ་གཉིས་སྟེང་གི་ནམ་མཁའ་ལས་འགྲོ་ཞིང་། རྒྱལ་པོའི་ཕོ་བྲང་དུ་འདོང་བར་བྱེད་དེ།
en: “So from time to time the two of them would travel through the sky to the royal palace

source: རྒྱལ་པོ་ཚངས་པས་བྱིན་ལ་བལྟར་འགྲོའོ། །
en: and go to see King Brahmadatta.

source: རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱིས་ཀྱང་དེ་གཉིས་འོང་ནས་ནམ་མཁའ་དེ་ཉིད་ལས་པང་དུ་བླངས་ཏེ། སྟན་ལ་བཞག་ནས།
en: Upon their arrival King Brahmadatta would take them from the sky into his lap and place them in their seats,

source: བཟའ་བ་དང་བཅའ་བ་གཙང་མ་བཟང་པོ་མང་པོས་ཚིམ་པར་བྱས་ཏེ། ཆོས་མཉན་པའི་ཕྱིར་དེ་མདུན་དུ་འདུག་གོ། །
en: and after contenting them with many good, wholesome foods he would sit before them to listen to the Dharma.

source: དེ་ནས་ཕྱི་ཞིག་ན་རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱིས་འབངས་རི་ཁྲོད་པ་རྣམས་ལོག་ནས་
en: “One day King Brahmadatta’s subjects who lived out in the mountains began to revolt.

source: དཔུང་གི་ཚོགས་གོ་བསྐོན་ཏེ་ཆས་ནས། དེས་བུ་མོ་ལ་བསྒོ་བ།
en: He arrayed the four divisions of his army and set out, telling his daughter,

source: བུ་དྲང་སྲོང་དེ་གཉིས་ནམ་འོངས་པ་དང་། ངས་ཅི་ལྟར་བཀུར་སྟི་བྱེད་པ་དེ་ཁོ་ན་བཞིན་དུ་ཁྱོད་ཀྱིས་ཀུན་གྱིས་ཤིག་ཅེས་བྱས་ནས། རྒྱལ་པོ་དེ་སོང་ངོ་། །
en: ‘When the two sages come you should serve and respect them in just the same way that I do.’ Having spoken thus the king departed.

source: དེ་ནས་ཕྱི་ཞིག་ན་རྒྱལ་པོའི་ཕོ་བྲང་དུ་དྲང་སྲོང་མེའི་བུ་དོན་ཅི་ཞིག་ཡོད་པའི་ཕྱིར། དེས་དྲང་སྲོང་མེ་ལྕེ་བཏང་སྟེ།
en: “Soon after, the sage Son of Fire sent the sage Tongue of Fire on an errand to the royal palace.

source: དེ་སྟེང་གི་ནམ་མཁའ་ལས་རྒྱལ་པོའི་ཕོ་བྲང་དུ་འོངས་ནས། བུ་མོ་དེས་དྲང་སྲོང་ནམ་མཁའ་ལ་འདུག་པ་པང་དུ་བླངས་ཏེ་འཁྱུད་ནས་སྟན་ལ་བཞག་གོ། །
en: He traveled through the sky to the royal palace, and upon the sage’s arrival the young woman received him, taking him from the sky into her lap, embracing him, and placing him in his seat.

source: བུད་མེད་རྣམས་ནི་རེག་ན་གདུག་པ་ཡིན་ཏེ།
en: “A woman’s touch is a dangerous thing.

source: བུ་མོ་དེས་རེག་མ་ཐག་ཏུ་དྲང་སྲོང་མེ་ལྕེ་རྫུ་འཕྲུལ་དེ་ལས་ཉམས་སོ། །
en: No sooner had the woman touched the sage Tongue of Fire than his miraculous powers began to dwindle.

source: བུ་མོ་དེ་ཡང་དྲང་སྲོང་དེ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་མཐོང་ནས་ཆགས་པར་གྱུར་ཏེ། དེ་དེ་དང་གནས་དབེན་པ་ཞིག་ཏུ་ཞུགས་ནས་དེ་དང་ལྷན་ཅིག་ཉལ་པོ་བྱས་སོ། །
en: The young woman, noting that the sage was well proportioned, pleasing to the eye, and beautiful, became very attached to him, and the two went off to an isolated place and slept together.

source: དེ་ནས་དེའི་བཙུན་མོའི་འཁོར་གྱིས་ཚོར་ཏེ། དེ་དག་གིས་བསམས་པ།
en: When the retinue of queens heard of this, they thought,

source: གལ་ཏེ་བདག་ཅག་གིས་དྲང་སྲོང་འདི་ལ་ཚིག་འགའ་ཞིག་བྱས་ན་ནི། དྲང་སྲོང་འདི་རྫུ་འཕྲུལ་ཆེ་བས་དམོད་པ་འདོར་སྲིད་དོ་སྙམ་སྟེ།
en: ‘If we say even a word to the sage, it’s possible the sage would use his great miracles and great power to curse us.’

source: དེ་དག་འཇིགས་སྐྲག་ནས། ཅུང་ཟད་ཀྱང་མ་སྨྲས་སོ། །
en: Afraid, they were unable to say anything.

source: དྲང་སྲོང་དེ་ཡང་རྒྱལ་པོའི་ཕོ་བྲང་དེ་ཉིད་དུ་འདུག་ཅིང་རྐང་པས་འགྲོར་ངོ་ཚ་སྟེ་མ་ཕོད་དོ། །
en: The sage remained at the royal palace, not daring to travel by foot out of embarrassment.

source: དེ་ནས་ཕྱི་ཞིག་ན་རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱིས་རི་ཁྲོད་པ་ཕབ་ནས་ཕྱིར་ལོག་སྟེ། རྒྱལ་པོའི་ཕོ་བྲང་དུ་འོངས་པ་དང་། དེས་དྲང་སྲོང་མེ་ལྕེ་འདིར་འོངས་སོ་ཞེས་ཐོས་ནས།
en: “Eventually King Brahmadatta returned from his victory over the mountain folk, arrived at the royal palace, and he heard that the sage Tongue of Fire had come there.

source: ཐོས་མ་ཐག་ཏུ་རྒྱལ་པོ་དེ་དེ་ལ་བལྟར་སོང་སྟེ། དེས་བཟའ་བ་དང་། བཅའ་བ་གཙང་མ་བཟང་པོ་མང་པོ་དག་ཕུལ་ལོ། །
en: The king hurried to see him and offered him many good, wholesome foods.

source: བུ་མོས་ཀྱང་དྲང་སྲོང་དེའི་སྐོམ་ཁྱེར་ཏེ་འོངས་སོ། །
en: His daughter came along, also bearing food and drink for the sage.

source: དེ་ནས་དེ་མཐོང་མ་ཐག་ཏུ་དྲང་སྲོང་དེ་ཤིན་ཏུ་ཆགས་པར་གྱུར་ཏོ། །
en: As soon as the sage saw her he was overcome with desire.

source: དྲང་སྲོང་དེ་མྱོས་པ་ཙམ་དུ་ཆགས་པར་གྱུར་ནས།
en: His desire for her intoxicated him,

source: རྒྱལ་པོ་དེའི་སྤྱན་སྔར་ལག་པ་བརྐྱང་ནས།
en: and before the king’s very eyes he reached out, saying,

source: ལག་པ་ནས་བཟུང་ཞེས་བྱས་པ་དང་།
en: ‘Take me into your arms.’

source: རྒྱལ་པོ་དེས་མཐོང་ནས་མཐོང་མ་ཐག་ཏུ་རལ་གྲི་རྣོན་པོ་ཐོགས་ཏེ། དྲང་སྲོང་དེ་གསད་པར་བྱས་པ་དང་།
en: When the king saw this, he immediately took up a sharp sword to slay the sage.

source: བུ་མོས་མཐོང་ནས་དྲང་སྲོང་དེ་ལ་སྨྲས་པ།
en: “Seeing this, the young woman said to the sage,

source: མཁན་པོ་ཅི་ལགས།
en: ‘Preceptor, what is this?

source: ཁྱོད་གསང་ནན་དགོས་པའི་ཕྱིར་འཁྲུལ་ཏེ་ཁྱོད་ཀྱིས་འདིར་ཕྱག་བརྐྱང་ལགས་སམ་ཞེས་བྱས་སོ། །
en: Perhaps you are confused because of some secret, pressing need, and now you are reaching your arms out?’

source: དེ་ནས་རྒྱལ་པོ་ཚངས་པས་བྱིན་དེ་དེ་བཞིན་དུ་ཡིད་ཆེས་པར་གྱུར་ཏེ།
en: “King Brahmadatta thought, ‘I believe that is the case.

source: དྲང་སྲོང་འདི་འཁྲུལ་ཏོ་སྙམ་དུ་བསམས་ནས། སྐྱེན་པར་སྐོམ་ཕུལ་ལོ། །
en: This sage must be confused,’ and quickly offered him something to drink.

source: དེ་ནས་དེ་ལ་ཟན་བྱིན་ནས་ཆོས་ཉན་པའི་ཕྱིར་མདུན་དུ་འདུག་གོ། །
en: Then they offered him food and sat before him to listen to the Dharma.

source: དེ་ནས་དྲང་སྲོང་མེའི་བུ་དཀའ་ཐུབ་ཀྱི་ནགས་ཚལ་ན་འདུག་པས་བསམས་པ།
en: “Now the sage Son of Fire, who was living in a forest devoted to austerities, wondered,

source: ཇི་དྲང་སྲོང་དེ་ད་ཙམ་གྱི་བར་དུ་མ་འོང་ན་ཅི་སྙམ་སྟེ།
en: ‘Why has the sage Tongue of Fire still not returned?’

source: དེས་བལྟས་ན་འདོད་པ་སྤྱོད་པར་གྱུར་ལ། སྐབས་སུ་ཆུད་ཅིང་འདུག་པ་མཐོང་ནས།
en: He looked out and saw that he was spending his time indulging his desires.

source: འདི་དེང་དུ་སྲོག་ཡལ་བར་གྱུར་སྲིད་དོ་སྙམ་ནས།
en: ‘He may now lose his life,’ he thought,

source: སྟེང་གི་བར་སྣང་ལས་རྒྱལ་པོའི་ཕོ་བྲང་དུ་འོང་ངོ་། །
en: so he traveled through the sky to the royal palace.

source: རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱིས་ཀྱང་། དྲང་སྲོང་དེ་ནམ་མཁའ་དེ་ཉིད་ལས་པང་དུ་བླངས་ནས། སྟན་ལ་བཞག་སྟེ། ཆོས་མཉན་པའི་ཕྱིར་མདུན་དུ་འདུག་གོ། །
en: “King Brahmadatta took the sage from the sky into his lap and placed him on his seat, then sat before him to listen to the Dharma.

source: དེ་ནས་དེས་རྒྱལ་པོ་དེ་ལ་ཆོས་ཐ་གི་ཙམ་བཤད་ནས། ནུ་བོ་ཁྲིད་དེ་སྟེང་གི་ནམ་མཁའ་ལས་དཀའ་ཐུབ་ཀྱི་ནགས་ཚལ་དུ་སོང་ངོ་། །
en: After he had explained just a little Dharma, he brought his younger brother back with him through the sky and returned him to the forest devoted to austerities.

source: དེ་ནས་དེས་དེ་ལ་ཡིད་ལ་བྱེད་པའི་མན་ངག་ཕོག་ནས། དེས་ཕྱིར་ཡང་བསམ་གཏན་བཞི་དང་། མངོན་པར་ཤེས་པ་ལྔ་བསྐྱེད་དོ། །
en: There he gave him instructions for contemplation such that he was again able to generate the four meditative states and the five superknowledges.

source: དེ་ནས་ཕྱི་ཞིག་ན་རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱི་བཙུན་མོའི་འཁོར་རྣམས་ཀྱིས་བསམས་པ།
en: “King Brahmadatta’s retinue of queens thought,

source: བུ་མོ་འདིས་མ་ལེགས་པ་འདི་ལྟ་བུ་བྱས་པ་དེ།
en: ‘This young woman has committed such unfortunate deeds.

source: གལ་ཏེ་བདག་ཅག་གིས་མ་གསོལ་ན། བདག་ཅག་ལ་ཡང་འདིའི་ཕྱིར་གྱོད་འབྱུང་བར་འགྱུར་རོ་སྙམ་ནས།
en: If we do not apprise him, we too will come to regret this.’

source: དེ་རྣམས་ཀྱིས་རྒྱལ་པོ་ལ་གསོལ་ཏོ། །
en: With this in mind they told the king.

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་རྒྱལ་པོ་ཚངས་པས་བྱིན་ཞེ་སྡང་ཆེན་པོའི་དབང་དུ་གྱུར་ནས།
en: When he heard what they had to say King Brahmadatta was immediately overcome with great hatred.

source: དེས་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་གོ་བསྐོན་ནས། དྲང་སྲོང་དེའི་གནས་སུ་སོང་ནས།
en: He arrayed the four divisions of his army and set out to where the sages lived.

source: དྲང་སྲོང་མེ་ལྕེས་རྒྱལ་པོ་ཚངས་པས་བྱིན་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་དང་ཆས་ཏེ་འོངས་པ་མཐོང་ངོ་། །
en: “The sage Tongue of Fire saw that King Brahmadatta had set out with the four divisions of his army and that they were on their way.

source: མཐོང་ནས་ཀྱང་སེམས་པ་ལ་ཞུགས་ཏེ། འདི་བསམ་པ་ཅི་ལྟ་བུ་ཞིག་གིས་འདིར་འོངས་སྙམ་སྟེ།
en: ‘Why would he come here?’ he wondered, and looking out, he thought,

source: དེས་བལྟས་ན་བདག་གསད་པར་འདོད་དོ་
en: ‘He wants to kill me!’

source: སྙམ་དུ་རིག་ནས། དེ་ཉིད་དད་པ་བསྐྱེད་པའི་ཕྱིར། སྟེང་གི་བར་སྣང་ལ་མངོན་པར་འཕགས་ཏེ་འདུག་གོ། །
en: Knowing this to be the case, he rose up into the sky and sat there to instill faith in the king.

source: དེ་ནས་རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱིས་དྲང་སྲོང་མེ་ལྕེ་སྟེང་གི་བར་སྣང་ལ་མངོན་པར་འཕགས་ཏེ་འདུག་པ་མཐོང་ནས།
en: King Brahmadatta saw that the sage Tongue of Fire had risen up into the sky and was just sitting there,

source: མཐོང་མ་ཐག་ཏུ་དེའི་ཁྲོ་བའི་ཀུན་ནས་དཀྲིས་པ་དེ་མེད་པར་གྱུར་ཏེ། ཐེ་ཙོམ་སྐྱེས་པ། ཇི་འདི་ངས་ཇི་སྐད་ཐོས་པ་དེ་བཞིན་དུ་གྱུར་ཏམ།
en: and at the sight of him his fury disappeared, and he became uncertain as to whether or not the man had done as he had heard.

source: འོན་ཏེ་མ་གྱུར་ཞིག་གུ་སྙམ་ནས། ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: “ ‘Well then,’ he thought, and he said in verse:

source: བྲམ་ཟེ་མེ་ལྕེ་བདག་གིས་ནི། །འདོད་པ་སྤྱོད་ཅེས་སྔར་ཐོས་ན། །
en: “ ‘I heard, brahmin Tongue of Fire, You indulged your desires.

source: ཚིག་དེ་བདེན་པ་ཡིན་ནམ་ཅི། །
en: Tell me— Were these words true?

source: འོན་ཏེ་ཅི་ལགས་མི་སྤྱོད་དམ། །
en: Or is this Something you did not do?’

source: རྒྱལ་པོ་ཆེན་པོ་དེ་བདེན་ཏེ། །ཁྱོད་ཀྱིས་གཞན་ལ་ཐོས་པ་བཞིན། །
en: “ ‘Great King, all that you have heard Others say of me is true.

source: བདག་ནི་ལམ་ངན་ཞུགས་གྱུར་ཏེ། །ཆགས་པའི་གནས་སུ་མྱོས་པར་གྱུར། །
en: I staggered down an awful path, Drunk on a swig of lust.’

source: དེ་ནས་རྒྱལ་པོ་ཚངས་པས་བྱིན་ཐེ་ཙོམ་སྐྱེས་ཏེ།
en: “At that, King Brahmadatta began to feel doubt.

source: དྲང་སྲོང་མེའི་བུའི་ཐད་དུ་སོང་ནས། དེས་དྲང་སྲོང་དེ་ལ་དྲིས་པ།
en: He approached the sage Son of Fire and asked him,

source: དྲང་སྲོང་ཅི་ལགས། དེའི་སླད་དུ་བདག་གིས་ཇི་སྐད་ཐོས་པ་དེ་ཁོ་ན་བཞིན་ལགས་སམ།
en: ‘Sage, tell me, why would I hear such things?’

source: དྲང་སྲོང་གིས་སྨྲས་པ། རྒྱལ་པོ་ཆེན་པོ་དེ་ཁོ་ན་བཞིན་དུ་བདེན་མོད་ཀྱིས། ཉོན་མོངས་པ་རྣམས་ནི་དེ་ལྟར་མཐུ་ཆེའོ། །
en: “ ‘Great King,’ the sage replied, ‘it may indeed be true in exactly the way you heard, for the afflictive emotions are overpowering.’

source: རྒྱལ་པོས་སྨྲས་པ། འོ་ན་འདི་ལྟར་འདོད་པ་ཡང་ལོངས་སྤྱོད་པར་བྱེད་ལ། རྫུ་འཕྲུལ་འདི་ལྟ་བུ་དག་དང་ཡང་ལྡན།
en: “ ‘But how can it be that he indulged his desires in this way and yet is still possessed of these miraculous powers?’ the king asked.

source: དྲང་སྲོང་གིས་སྨྲས་པ། རྒྱལ་པོ་ཆེན་པོ་དྲང་སྲོང་འདི་གང་གི་ཚེ། འདོད་པ་ལ་སྤྱོད་པར་གྱུར་པ་དེའི་ཚེ་ནི་རྫུ་འཕྲུལ་ལས་ཉམས་སོ། །
en: “ ‘Great King,’ the sage replied, ‘when he indulged his desires his miraculous powers dwindled.

source: འདི་གནས་དེ་ནས་བདག་གིས་ཁྲིད་དེ་དེ་ལ་ལུང་ཡང་ཕོག །ཡིད་ལ་བྱེད་པའི་ཐབས་ཀྱང་བསྟན་ནས།
en: I brought him away from that place and gave him instructions, teaching him a method of contemplation.

source: འདིས་ཀྱང་ཕྱིར་ཡང་རྫུ་འཕྲུལ་བསྐྱེད་དོ། །
en: Later he began to perform miracles again.’

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་རྒྱལ་པོ་དེ་དེ་ལ་དགའ་བར་གྱུར་ནས་དེས་དྲང་སྲོང་དེའི་རྐང་པ་ལ་ཕྱག་འཚལ་ཏེ་བཟོད་པ་གསོལ་ནས་སོང་ངོ་། །
en: “Hearing this the king felt a surge of joy toward him. He bowed down at the sage’s feet, asked his forgiveness, and departed.

source: དེའི་ཚེ་དྲང་སྲོང་མེའི་བུར་གྱུར་པ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་གནས་པ་གང་ཡིན་པ་དེ་ནི་ང་ཉིད་ཡིན་ནོ། །
en: I am the one who was that sage then and lived the life of a bodhisattva.

source: དེའི་ཚེ་དེའི་ནུ་བོར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི། ནག་པ་གླང་ཆེན་གནས་འདི་ཁོ་ན་ཡིན་ནོ། །
en: The one who was my younger brother then is none other than Citra Mounted on an Elephant.

source: དེའི་ཚེ་རྒྱལ་པོའི་བུ་མོར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི། ཆུང་མ་འདི་ཁོ་ན་ཡིན་ཏེ།
en: The one who was the young woman then is none other than his wife.

source: དེའི་ཚེ་ཡང་དེས་ཚངས་པར་སྤྱོད་པའི་གནས་ལས་ཉམས་པར་བྱས་ཏེ། འདོད་པ་སྤྱོད་པ་ལ་གནས་པར་བྱས་པ་ལས།
en: At that time he fell from the celibate state and began to indulge his desires

source: དེ་ངས་དེ་ནས་དྲངས་ཏེ་ཕྱིར་ཡང་བསམ་གཏན་བཞི་དང་། མངོན་པར་ཤེས་པ་ལྔ་ལ་གནས་པར་བྱས་ལ།
en: until I lifted him up again and placed him in the four meditative states and five superknowledges.

source: ད་ལྟར་ཡང་འདིས་འདི་ཚངས་པར་སྤྱོད་པའི་གནས་ལས་ཉམས་པར་བྱས་ནསའདོད་པ་ལ་སྤྱོད་པ་ལ་གནས་པར་བྱས་པ་ལས་
en: Now as well he has fallen from the celibate state and indulged his desires,

source: དེ་ངས་དེ་ནས་དྲངས་ཏེ། གཡུང་དྲུང་གི་མཐར་ཐུག་པ་གྲུབ་པ་དང་། བདེ་བའི་མྱ་ངན་ལས་འདས་པ་ལ་བཞག་གོ། །
en: and I have lifted him up and established him in the unsurpassed, supreme welfare of nirvāṇa.

source: དེས་དེར་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ནས། དབང་པོ་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱས་པ་དེས་ནད་ལྟར་རྣམ་པར་གྲོལ་བར་གྱུར་ཏོ།། །།
en: After practicing pure conduct all his life then, his faculties ripened, and now he has been liberated.”

source: ས་ར་ན་ཞེས་བྱ་བ་ནི།
en: The Story of Saraṇa

source: གླེང་གཞི་རྒྱལ་པོའི་ཁབ་ན་བཞུགས་ཏེ། དེའི་ཚེ་ཡུལ་གྱེན་དུ་རྒྱལ་ཞེས་བྱ་བ་ན་ནི། རྒྱལ་པོ་རབ་སྣང་ཞེས་བྱ་བ་རྒྱལ་པོ་བྱེད་དོ། །
en: When the Blessed One was in Rājagṛha, King Pradyota reigned in Ujjayinī,

source: ཡུལ་དཔའ་རབ་ཅེས་བྱ་བ་ན་ནི། རྒྱལ་པོ་འཆར་ཀ་ཞེས་བྱ་བ་རྒྱལ་པོ་བྱེད་དེ།
en: and King Udayana reigned in Vatsa.

source: དེ་གཉིས་ཕན་ཚུན་མི་འཐུན་པར་གྱུར་པས། དུས་དུས་སུ་སྐྱེ་བོ་ཕལ་པོ་ཆེ་ཁ་འདོག་པར་བྱེད་དོ། །
en: The two did not agree with one another, and from time to time a great many people were killed.

source: དེ་ནས་གང་གི་ཚེ་ཚེ་དང་ལྡན་པ་ཀཱ་ཏྱཱ་ཡ་ནའི་བུས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་པ་དེའི་ཚེ། དེས་བསམས་པ་
en: When Venerable Kātyāyanaputra cast away all afflictive emotions and manifested arhatship, he thought,

source: བཅོམ་ལྡན་འདས་ནི་བདག་གི་སྡུག་བསྔལ་དང་། ཡིད་མི་བདེ་བ་མང་པོ་སེལ་བ་ཡིན།
en: “The Blessed One has dispelled so many kinds of suffering and anguish,

source: བདེ་བ་དང་ཡིད་བདེ་བ་རྣམ་པ་དུ་མ་བསྒྲུབ་པ་ཡིན།
en: brought me so many kinds of happiness and bliss,

source: སྡིག་པ་མི་དགེ་བའི་ཆོས་རྣམ་པ་དུ་མ་སེལ་བ་ཡིན།
en: cleared away so many of my sins and nonvirtues,

source: དགེ་བའི་ཆོས་རྣམ་པ་དུ་མ་བསྒྲུབ་པ་ཡིན་ལ།
en: and secured for me such virtues.

source: དགེ་བའི་བཤེས་གཉེན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་བརྟེན་ཏེ། རུས་པའི་རི་ལས་ནི་བརྒལ། ཁྲག་དང་། མཆི་མའི་རྒྱ་མཚོ་ནི་བསྐམས་ན།
en: After I entrusted myself to the Blessed Buddha as my spiritual friend, he led me over the mountain pass of bones and dried up an ocean of blood and tears.

source: བཅོམ་ལྡན་འདས་དེའི་བཀའ་དྲིན་བདག་གིས་ཅི་ལྟར་བསབ་པར་བྱ་སྙམ་མོ། །
en: How could I repay the Blessed One’s kindness?”

source: དེ་ནས་ཡང་བསམས་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་འཇིག་རྟེན་དུ་འབྱུང་བ་གང་ཡང་རུང་བ་དེ་དག་ཐམས་ཅད་ནི། སེམས་ཅན་ལ་ཕན་པའི་ཕྱིར་འབྱུང་བ་ཁོ་ནར་ཟད་ཀྱིས།
en: And then he thought, “Anytime a blessed buddha arises in the world, it is only to benefit beings.

source: མ་ལ་བདག་གིས་ཀྱང་སེམས་ཅན་ལ་ཕན་པར་བྱའོ་སྙམ་མོ། །
en: Surely then I should also act for the benefit of beings!”

source: དེ་ནས་དེ་སེམས་པ་ལ་ཞུགས་ཏེ།
en: Reflecting in this way, he began to wonder,

source: བདག་གིས་འདུལ་བར་བྱ་བ་འགའ་ལྟ་ཅི་ཡོད་སྙམ་པ་དང་།
en: “Whom might I tame?”

source: དེས་བལྟས་ན་ཡུལ་དཔའ་རབ་ཅེས་བྱ་བ་ན་གནས་པའི་སྐྱེ་བོ་མང་པོ་རྣམས་ལྷག་པར་བདག་གིས་གདུལ་བར་བྱ་བ་ཡིན་པར་མཐོང་ནས
en: Then he looked out, and he saw that he could tame many in Vatsa.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: He went to see the Blessed One,

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: bowed toward him with palms pressed together, and implored him,

source: བཙུན་པ་བདག་ལྗོངས་རྒྱུ་ཞིང་མཆི་བར་འཚལ་ལོ། །
en: “Lord, I wish to go out into the countryside.”

source: ཀཱ་ཏྱཱ་ཡ་ནའི་བུ་ཁྱོད་སོང་ལ་
en: “Go, Kātyāyanaputra.

source: བདག་བརྒལ་ནས་གཞན་སྒྲོལ་ཤིག །
en: Deliver others just as you yourself have crossed over.

source: བདག་གྲོལ་ནས་གཞན་གྲོལ་བར་གྱིས་ཤིག །
en: Liberate others just as you yourself have been liberated.

source: བདག་དབུགས་ཕྱུང་ནས་གཞན་དབུགས་ཕྱུང་ཤིག །
en: Relieve others just as you yourself have found relief.

source: བདག་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནསགཞན་ཡོངས་སུ་མྱ་ངན་ལས་ཟློས་ཤིག །
en: Lead others to pass beyond all sorrow just as you yourself have completely passed beyond all sorrow.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཀཱ་ཏྱཱ་ཡ་ནའི་བུས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། འཁོར་ལྔ་བརྒྱ་དང་ལྗོངས་རྒྱུ་ཞིང་སོང་ངོ་། །
en: Venerable Kātyāyanaputra touched his head to the Blessed One’s feet and departed to travel through the countryside with a company of five hundred.
